src/cf/Enums/инт_ТипыПодписчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_ТипыПодписчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RabbitMQ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодсистемаИнтеграции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйHTTP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/инт_ТипыПодписчиков/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// 
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Общий модуль обработки сообщений по типу подписчика
// Получает ОМ для обработки сообщений
// Параметры:
//  ТипПодписчика  - ПеречислениеСсылка.инт_ТипыПодписчиков - ссылка на тип подписчика.
// 
// Возвращаемое значение:
//  ОбщийМодуль - Модуль содержащий процедуры и функции для работы с сообщениями.
//
Функция ОбщийМодульОбработкиСообщенийПоТипуПодписчика(ТипПодписчика) Экспорт
    
    ОбщийМодуль = Неопределено;
    
    Если ТипПодписчика = Перечисления.инт_ТипыПодписчиков.ПодсистемаИнтеграции Тогда
        ОбщийМодуль = инт_РаботаССообщениямиПодсистемаИнтеграции;
    ИначеЕсли ТипПодписчика = Перечисления.инт_ТипыПодписчиков.RabbitMQ Тогда
        ОбщийМодуль = инт_РаботаССообщениямиRabbitMQ;
    ИначеЕсли  ТипПодписчика = Перечисления.инт_ТипыПодписчиков.ПроизвольныйHTTP Тогда
        ОбщийМодуль = инт_РаботаССообщениямиПроизвольныйHTTP;
    Иначе
        ВызватьИсключение СтрШаблон("Для переданного типа подписчика <%1> не удалось определить модуль обработки сообщений! Либо вы передали какую-то ересь, либо это страшный баг.", ТипПодписчика);
    КонецЕсли;
    Возврат ОбщийМодуль;
 		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
